{
    "categories": [
        {
            "id": "citrus",
            "name": "Цитрусові",
            "items": [
                {
                    "id": "orange",
                    "name": "Апельсин",
                    "image": "images/orange.png",
                    "benefits": "Багарий на вітамін C, підтримує імунітет, покращує стан шкіри, знижує рівень холестерину.",
                    "facts": "Апельсини були завезені в Європу португальськими мореплавцями в XV столітті. Вони є гібридом мандарина та помело.",
                    "tips": "Найкраще вживати свіжими або у вигляді соку. Зберігати при кімнатній температурі до 2 тижнів."
                },
                {
                    "id": "grapefruit",
                    "name": "Грейпфрут",
                    "image": "images/grapefruit.png",
                    "benefits": "Сприяє схудненню, покращує травлення, знижує рівень цукру в крові, багатий на антиоксиданти.",
                    "facts": "Грейпфрут виник як природний гібрид апельсина та помело. Його назва походить від того, що плоди ростуть гронами, як виноград.",
                    "tips": "Вживати на сніданок або як перекус. Не рекомендується вживати разом з деякими ліками."
                },
                {
                    "id": "lemon",
                    "name": "Лимон",
                    "image": "images/lemon.png",
                    "benefits": "Посилює імунітет, покращує травлення, допомагає при застудах, очищає організм.",
                    "facts": "Лимонний сік використовується для консервації продуктів завдяки своїй кислотності. Один лимон містить близько 30-40 мл соку.",
                    "tips": "Додавати в чай, воду або використовувати як приправу до страв. Зберігати в холодильнику."
                },
                {
                    "id": "mandarin",
                    "name": "Мандарин",
                    "image": "images/mandarin.jpg",
                    "benefits": "Посилює імунітет, покращує зір, сприяє здоров'ю шкіри, багатий на вітамін C.",
                    "facts": "Мандарини були виведені в Китаї понад 3000 років тому. Вважаються символом Нового року в багатьох азійських країнах.",
                    "tips": "Вживати свіжими або додавати до салатів. Зберігати при кімнатній температурі."
                },
                {
                    "id": "lime",
                    "name": "Лайм",
                    "image": "images/lime.jpg",
                    "benefits": "Посилює імунітет, покращує травлення, допомагає при застудах, багатий на вітамін C.",
                    "facts": "Лайм містить більше вітаміну C, ніж лимон. Використовується в багатьох коктейлях, включаючи мохіто та маргариту.",
                    "tips": "Додавати в напої, використовувати як приправу до страв. Зберігати в холодильнику."
                }
            ]
        },
        {
            "id": "berries",
            "name": "Ягоди",
            "items": [
                {
                    "id": "strawberry",
                    "name": "Полуниця",
                    "image": "images/strawberry.png",
                    "benefits": "Багата на антиоксиданти, покращує зір, підтримує здоров'я серця, знижує запалення.",
                    "facts": "Полуниця - це єдина ягода, насіння якої росте зовні. Вона належить до родини трояндових.",
                    "tips": "Вживати свіжими, додавати до десертів або смузі. Зберігати в холодильнику не більше 2-3 днів."
                },
                {
                    "id": "raspberry",
                    "name": "Малина",
                    "image": "images/raspberry.jpg",
                    "benefits": "Посилює імунітет, покращує травлення, знижує запалення, багата на вітаміни.",
                    "facts": "Малина містить природний аспірин, тому допомагає при головному болі. Вважається афродизіаком.",
                    "tips": "Вживати свіжими, додавати до десертів або заморожувати. Зберігати в холодильнику."
                },
                {
                    "id": "blueberry",
                    "name": "Чорниця",
                    "image": "images/blueberry.jpg",
                    "benefits": "Покращує зір, підтримує здоров'я мозку, знижує рівень цукру в крові, багата на антиоксиданти.",
                    "facts": "Чорниця - одна з найбагатших на антиоксиданти ягід. Використовується для покращення нічного зору.",
                    "tips": "Вживати свіжими, додавати до каш або смузі. Можна заморожувати для довготривалого зберігання."
                },
                {
                    "id": "currant",
                    "name": "Смородина",
                    "image": "images/currant.jpg",
                    "benefits": "Посилює імунітет, покращує травлення, знижує запалення, багата на вітамін C.",
                    "facts": "Смородина була заборонена в США на початку 20 століття через помилкову думку про поширення хвороби сосен.",
                    "tips": "Вживати свіжими, додавати до десертів або робити варення. Зберігати в холодильнику."
                }
            ]
        },
        {
            "id": "root-vegetables",
            "name": "Коренеплоди",
            "items": [
                {
                    "id": "carrot",
                    "name": "Морква",
                    "image": "images/carrot.jpg",
                    "benefits": "Покращує зір, підтримує здоров'я шкіри, зміцнює імунітет, багата на вітамін A.",
                    "facts": "Перша морква була фіолетовою. Помаранчева морква була виведена в Нідерландах на честь королівської родини.",
                    "tips": "Вживати свіжими, додавати до салатів або супів. Зберігати в прохолодному місці."
                },
                {
                    "id": "beetroot",
                    "name": "Буряк",
                    "image": "images/beetroot.png",
                    "benefits": "Покращує кровообіг, знижує тиск, підтримує здоров'я печінки, багатий на залізо.",
                    "facts": "Буряк використовується для виробництва цукру. Його сік використовується як натуральний барвник.",
                    "tips": "Вживати вареним, додавати до салатів або робити сік. Зберігати в прохолодному місці."
                },
                {
                    "id": "potato",
                    "name": "Картопля",
                    "image": "images/potato.jpg",
                    "benefits": "Багата на калій, підтримує здоров'я серця, покращує травлення, джерело енергії.",
                    "facts": "Картопля була завезена в Європу з Південної Америки. Вона стала основною їжею в багатьох країнах.",
                    "tips": "Вживати вареною, печеною або в супах. Зберігати в прохолодному темному місці."
                },
                {
                    "id": "radish",
                    "name": "Редиска",
                    "image": "images/radish.png",
                    "benefits": "Покращує травлення, підтримує здоров'я печінки, знижує запалення, багата на вітамін C.",
                    "facts": "Редиска - одна з найшвидших овочів для вирощування. Деякі сорти можуть бути готові до вживання вже через 3 тижні.",
                    "tips": "Вживати свіжими, додавати до салатів. Зберігати в холодильнику."
                }
            ]
        },
        {
            "id": "leafy-greens",
            "name": "Листові овочі",
            "items": [
                {
                    "id": "spinach",
                    "name": "Шпинат",
                    "image": "images/spinach.jpg",
                    "benefits": "Багатий на залізо, підтримує здоров'я кісток, покращує зір, знижує тиск.",
                    "facts": "Шпинат став популярним після виходу мультфільму про Попая. Він дійсно багатий на залізо, але не в такій кількості, як показували в мультфільмі.",
                    "tips": "Вживати свіжим у салатах або додавати до супів. Зберігати в холодильнику."
                },
                {
                    "id": "lettuce",
                    "name": "Салат",
                    "image": "images/lettuce.png",
                    "benefits": "Покращує травлення, підтримує здоров'я шкіри, знижує запалення, багатий на вітаміни.",
                    "facts": "Салат був вирощений ще в Стародавньому Єгипті. Він належить до родини айстрових.",
                    "tips": "Вживати свіжим у салатах. Зберігати в холодильнику."
                },
                {
                    "id": "cabbage",
                    "name": "Капуста",
                    "image": "images/cabbage.png",
                    "benefits": "Покращує травлення, підтримує здоров'я шкіри, знижує запалення, багата на вітамін C.",
                    "facts": "Капуста була вирощена ще в Стародавній Греції. Вона належить до родини хрестоцвітих.",
                    "tips": "Вживати свіжою, вареною або квашеною. Зберігати в прохолодному місці."
                },
                {
                    "id": "kale",
                    "name": "Кейл",
                    "image": "images/kale.jpg",
                    "benefits": "Багатий на вітаміни та мінерали, підтримує здоров'я кісток, покращує зір, знижує запалення.",
                    "facts": "Кейл - один з найбільш поживних овочів. Він належить до родини хрестоцвітих.",
                    "tips": "Вживати свіжим у салатах або додавати до смузі. Зберігати в холодильнику."
                }
            ]
        },
        {
            "id": "exotic-fruits",
            "name": "Екзотичні фрукти",
            "items": [
                {
                    "id": "banana",
                    "name": "Банан",
                    "image": "images/banana.png",
                    "benefits": "Банан багатий на калій, магній, вітаміни B6 і C. Підтримує здоров'я серця, покращує настрій, дає енергію.",
                    "facts": "Банан — одна з найпопулярніших фруктів у світі. Він не росте на дереві, а на трав'янистій рослині. Стиглі банани містять більше цукру, а зелені — більше крохмалю.",
                    "tips": "Вживати свіжим, додавати до каш, смузі, випічки. Банани добре поєднуються з арахісовою пастою та йогуртом. Зберігати при кімнатній температурі."
                }
            ]
        }
    ]
} 